sudo-tracker-api/app/controllers/friendships_controller.rb

INSERT INTO "users" ("email_address", "created_at", "updated_at") VALUES (?, ?, ?)  [["email_address", "asdasd@gmail.com"], ["created_at", "2020-07-07 18:41:47.220412"], ["updated_at", "2020-07-07 18:41:47.220412"]]
SELECT "users".* FROM "users" WHERE "users"."email_address" = ? LIMIT ?  [["email_address", "asdasd@gmail.com"], ["LIMIT", 1]]
INSERT INTO "friendships" ("user_1_id", "user_2_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_1_id", 8], ["user_2_id", 6], ["created_at", "2020-07-07 18:41:47.229282"], ["updated_at", "2020-07-07 18:41:47.229282"]]
---
  def create
    user = User.find_or_create_by(email_address: params[:email])
    friendship = Friendship.create(user_1_id: user.id, user_2_id: 17)