sudo-tracker-api/app/controllers/habits_controller.rb

INSERT INTO "habits" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Cooking "], ["description", "lots of cooking"], ["created_at", "2020-07-07 15:44:14.567732"], ["updated_at", "2020-07-07 15:44:14.567732"]]
INSERT INTO "user_habits" ("user_id", "habit_id", "straight_days", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", "4"], ["habit_id", "18"], ["straight_days", "0"], ["created_at", "2020-07-07 15:48:01.566316"], ["updated_at", "2020-07-07 15:48:01.566316"]]
---
  def create
    habit = Habit.create(name: params[:name], description: params[:description])
    userHabit = UserHabit.create(habit_id: habit.id, user_id: params[:id], straight_days: 0)

SELECT "habits".* FROM "habits" WHERE "habits"."id" = ? LIMIT ?  [["id", 92], ["LIMIT", 1]]
SELECT "user_habits".* FROM "user_habits" WHERE "user_habits"."habit_id" = ? LIMIT ?  [["habit_id", "92"], ["LIMIT", 1]]
DELETE FROM "habits" WHERE "habits"."id" = ?  [["id", 92]]
DELETE FROM "user_habits" WHERE "user_habits"."id" = ?  [["id", 92]]
---
  def destroy
    habit = Habit.find(params[:id])
    userHabit = UserHabit.find_by(habit_id: params[:id])
    habit.destroy
    userHabit.destroy