sudo-tracker-api/app/controllers/user_habits_controller.rb

  def update
    userHabit = UserHabit.find(params[:id])
    userHabit.straight_days = params[:straight_days]
    userHabit.save
---
SELECT "user_habits".* FROM "user_habits" WHERE "user_habits"."id" = ? LIMIT ?  [["id", 50], ["LIMIT", 1]]
UPDATE "user_habits" SET "straight_days" = ?, "updated_at" = ? WHERE "user_habits"."id" = ?  [["straight_days", "1"], ["updated_at", "2020-07-07 23:33:23.827486"], ["id", 50]]