sudo-tracker-api/app/controllers/users_controller.rb

  def login
    user = User.find_by(email_address: params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email_address" = ? LIMIT ?  [["email_address", "emilioquintana90@gmail.com"], ["LIMIT", 1]]