sudo-tracker-api/app/serializers/habit_serializer.rb

SELECT "user_habits".* FROM "user_habits" WHERE "user_habits"."habit_id" = ? LIMIT ?  [["habit_id", "115"], ["LIMIT", 1]]
---
  def user_habit_id
    user_habit = UserHabit.find_by(habit_id: @object.id)