sudo-tracker-api/app/serializers/user_serializer.rb

SELECT "user_habits".* FROM "user_habits" WHERE "user_habits"."user_id" = ?  [["user_id", "41"]]
---
  def user_habits
    @object.user_habits.map { |userHabit|